itog/src/Documents/СписаниеСРасчетногоСчета/СписаниеСРасчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСРасчетногоСчета</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ВозвратОтКлиента</basedOn>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>CatalogRef.СчетаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

itog/src/Documents/СписаниеСРасчетногоСчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

 КонецПроцедуры

 
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	//Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	 Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеСРасчетногоСчета) Тогда
		 КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		 КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.СписаниеСРасчетногоСчета.ПолноеИмя();
		 КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.СписаниеСРасчетногоСчета);
		 КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		 Возврат КомандаСоздатьНаОсновании;
	 КонецЕсли;
	 Возврат Неопределено;
 КонецФункции
 
#КонецЕсли
Процедура ПечатьСписаниеСРасчетногоСчета(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.СписаниеСРасчетногоСчета.ПолучитьМакет("ПФ_MXL_ПечатьСписаниеСРасчетногоСчета");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Валюта,
	|	СписаниеСРасчетногоСчета.Дата,
	|	СписаниеСРасчетногоСчета.Номер,
	|	СписаниеСРасчетногоСчета.Основание,
	|	СписаниеСРасчетногоСчета.Получатель,
	|	СписаниеСРасчетногоСчета.СуммаДокумента,
	|	СписаниеСРасчетногоСчета.СчетСписания
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
